zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxw/pinctrl/MCXW236AIHNAR-pinctrl.h
#define DMA1_TRIG17_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA1_TRIG18_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA1_TRIG19_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define FC0_SCK_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 1) /* PIO0_4 */
#define GPIO_PIO04_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT_PINT0_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT_PINT1_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT_PINT2_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT_PINT3_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT_PINT4_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT_PINT5_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT_PINT6_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT_PINT7_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define SCT0_OUT7_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define SECGPIO_SEC_PIO04_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 7) /* PIO0_4 */
#define SECPINT_SECPINT0_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 7) /* PIO0_4 */
#define SECPINT_SECPINT1_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 7) /* PIO0_4 */
#define CTIMER0_CAPTURE0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER0_CAPTURE1_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER0_CAPTURE2_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER0_CAPTURE3_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER1_CAPTURE0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER1_CAPTURE1_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER1_CAPTURE2_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER1_CAPTURE3_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER1_MATCH1_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 9) /* PIO0_5 */
#define CTIMER2_CAPTURE0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER2_CAPTURE1_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER2_CAPTURE2_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER2_CAPTURE3_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER3_CAPTURE0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER3_CAPTURE1_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER3_CAPTURE2_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER3_CAPTURE3_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER4_CAPTURE0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER4_CAPTURE1_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER4_CAPTURE2_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define CTIMER4_CAPTURE3_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define DMA0_TRIG00_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG010_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG011_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG012_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG013_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG014_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG015_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG016_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG017_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG018_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG019_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG01_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG020_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG021_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG022_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG02_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG03_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG04_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG05_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG06_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG07_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG08_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA0_TRIG09_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA1_TRIG10_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA1_TRIG11_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA1_TRIG12_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA1_TRIG13_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA1_TRIG14_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA1_TRIG15_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA1_TRIG16_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA1_TRIG17_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA1_TRIG18_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA1_TRIG19_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define FC2_CTS_SDA_SSEL0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 2) /* PIO0_5 */
#define GPIO_PIO05_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT_PINT0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT_PINT1_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT_PINT2_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT_PINT3_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT_PINT4_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT_PINT5_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT_PINT6_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT_PINT7_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PLU_INPUT0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 6) /* PIO0_5 */
#define SCT0_OUT6_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 3) /* PIO0_5 */
#define SECGPIO_SEC_PIO05_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 7) /* PIO0_5 */
#define SECPINT_SECPINT0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 7) /* PIO0_5 */
#define SECPINT_SECPINT1_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 7) /* PIO0_5 */
#define SPIFI_CSN_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 8) /* PIO0_5 */
#define UTICK0_CAPTURE0_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 5) /* PIO0_5 */
#define CTIMER0_CAPTURE0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER0_CAPTURE1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER0_CAPTURE2_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER0_CAPTURE3_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER1_CAPTURE0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER1_CAPTURE1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER1_CAPTURE2_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER1_CAPTURE3_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER1_MATCH2_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 9) /* PIO0_6 */
#define CTIMER2_CAPTURE0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER2_CAPTURE1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER2_CAPTURE2_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER2_CAPTURE3_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER3_CAPTURE0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER3_CAPTURE1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER3_CAPTURE2_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER3_CAPTURE3_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER4_CAPTURE0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER4_CAPTURE1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER4_CAPTURE2_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER4_CAPTURE3_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define DMA0_TRIG00_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG010_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG011_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG012_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG013_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG014_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG015_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG016_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG017_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG018_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG019_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG01_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG020_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG021_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG022_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG02_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG03_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG04_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG05_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG06_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG07_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG08_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA0_TRIG09_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA1_TRIG10_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA1_TRIG11_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA1_TRIG12_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA1_TRIG13_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA1_TRIG14_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA1_TRIG15_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA1_TRIG16_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA1_TRIG17_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA1_TRIG18_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA1_TRIG19_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define FC2_RXD_SDA_MOSI_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define GPIO_PIO06_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT_PINT0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT_PINT1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT_PINT2_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT_PINT3_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT_PINT4_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT_PINT5_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT_PINT6_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT_PINT7_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PLU_INPUT1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 6) /* PIO0_6 */
#define RADIO_ANT_SWITCH0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 14) /* PIO0_6 */
#define SCT0_OUT5_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 3) /* PIO0_6 */
#define SECGPIO_SEC_PIO06_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 7) /* PIO0_6 */
#define SECPINT_SECPINT0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 7) /* PIO0_6 */
#define SECPINT_SECPINT1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 7) /* PIO0_6 */
#define SPIFI0_IO0_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 8) /* PIO0_6 */
#define UTICK0_CAPTURE1_PIO0_6 IOCON_MUX(6, IOCON_TYPE_D, 5) /* PIO0_6 */
#define CTIMER0_CAPTURE0_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER0_CAPTURE1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER0_CAPTURE2_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER0_CAPTURE3_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER1_CAPTURE0_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER1_CAPTURE1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER1_CAPTURE2_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER1_CAPTURE3_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER1_MATCH3_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 9) /* PIO0_7 */
#define CTIMER2_CAPTURE0_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER2_CAPTURE1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER2_CAPTURE2_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER2_CAPTURE3_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER3_CAPTURE0_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER3_CAPTURE1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER3_CAPTURE2_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER3_CAPTURE3_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER4_CAPTURE0_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER4_CAPTURE1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER4_CAPTURE2_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define CTIMER4_CAPTURE3_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define DMA0_TRIG00_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG010_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG011_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG012_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG013_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG014_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG015_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG016_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG017_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG018_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG019_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG01_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG020_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG021_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG022_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG02_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG03_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG04_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG05_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG06_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG07_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG08_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA0_TRIG09_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA1_TRIG10_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA1_TRIG11_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA1_TRIG12_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA1_TRIG13_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA1_TRIG14_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA1_TRIG15_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA1_TRIG16_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA1_TRIG17_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA1_TRIG18_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA1_TRIG19_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define FC2_TXD_SCL_MISO_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 2) /* PIO0_7 */
#define GPIO_PIO07_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT_PINT0_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT_PINT1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT_PINT2_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT_PINT3_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT_PINT4_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT_PINT5_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT_PINT6_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT_PINT7_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PLU_INPUT2_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 6) /* PIO0_7 */
#define RADIO_ANT_SWITCH1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 14) /* PIO0_7 */
#define SCT0_OUT4_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 3) /* PIO0_7 */
#define SECGPIO_SEC_PIO07_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 7) /* PIO0_7 */
#define SECPINT_SECPINT0_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 7) /* PIO0_7 */
#define SECPINT_SECPINT1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 7) /* PIO0_7 */
#define SPIFI0_IO1_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 8) /* PIO0_7 */
#define UTICK0_CAPTURE2_PIO0_7 IOCON_MUX(7, IOCON_TYPE_D, 5) /* PIO0_7 */
#define CTIMER0_CAPTURE0_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER0_CAPTURE1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER0_CAPTURE2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER0_CAPTURE3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER1_CAPTURE0_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER1_CAPTURE1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER1_CAPTURE2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER1_CAPTURE3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER2_CAPTURE0_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER2_CAPTURE1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER2_CAPTURE2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER2_CAPTURE3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER2_MATCH0_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 9) /* PIO0_8 */
#define CTIMER3_CAPTURE0_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER3_CAPTURE1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER3_CAPTURE2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER3_CAPTURE3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER4_CAPTURE0_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER4_CAPTURE1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER4_CAPTURE2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define CTIMER4_CAPTURE3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define DMA0_TRIG00_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG010_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG011_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG012_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG013_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG014_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG015_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG016_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG017_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG018_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG019_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG01_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG020_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG021_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG022_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG02_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG03_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG04_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG05_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG06_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG07_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG08_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA0_TRIG09_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA1_TRIG10_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA1_TRIG11_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA1_TRIG12_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA1_TRIG13_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA1_TRIG14_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA1_TRIG15_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA1_TRIG16_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA1_TRIG17_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA1_TRIG18_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA1_TRIG19_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define FC2_RTS_SCL_SSEL1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 2) /* PIO0_8 */
#define GPIO_PIO08_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT_PINT0_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT_PINT1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT_PINT2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT_PINT3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT_PINT4_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT_PINT5_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT_PINT6_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT_PINT7_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PLU_INPUT3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 6) /* PIO0_8 */
#define RADIO_ANT_SWITCH2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 14) /* PIO0_8 */
#define SCT0_IN0_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 3) /* PIO0_8 */
#define SCT0_IN1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 3) /* PIO0_8 */
#define SCT0_IN2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 3) /* PIO0_8 */
#define SCT0_IN3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 3) /* PIO0_8 */
#define SCT0_IN4_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 3) /* PIO0_8 */
#define SCT0_IN5_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 3) /* PIO0_8 */
#define SCT0_IN6_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 3) /* PIO0_8 */
#define SECGPIO_SEC_PIO08_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 7) /* PIO0_8 */
#define SECPINT_SECPINT0_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 7) /* PIO0_8 */
#define SECPINT_SECPINT1_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 7) /* PIO0_8 */
#define SPIFI0_IO2_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 8) /* PIO0_8 */
#define UTICK0_CAPTURE3_PIO0_8 IOCON_MUX(8, IOCON_TYPE_D, 5) /* PIO0_8 */
#define CLKOUT_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 4) /* PIO0_9 */
#define CTIMER0_CAPTURE0_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER0_CAPTURE1_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER0_CAPTURE2_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER0_CAPTURE3_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER1_CAPTURE0_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER1_CAPTURE1_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER1_CAPTURE2_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER1_CAPTURE3_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER2_CAPTURE0_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER2_CAPTURE1_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER2_CAPTURE2_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER2_CAPTURE3_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER2_MATCH1_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 9) /* PIO0_9 */
#define CTIMER3_CAPTURE0_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER3_CAPTURE1_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER3_CAPTURE2_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER3_CAPTURE3_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER4_CAPTURE0_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER4_CAPTURE1_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER4_CAPTURE2_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
#define CTIMER4_CAPTURE3_PIO0_9 IOCON_MUX(9, IOCON_TYPE_D, 10) /* PIO0_9 */
